In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('insurance_1.csv')

In [4]:
data.head(5)

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900         0    yes  southwest  16884.92400
1  18.0    male  33.770         1     no  southeast   1725.55230
2  28.0    male  33.000         3     no  southeast   4449.46200
3  33.0    male  22.705         0     no  northwest  21984.47061
4  32.0    male  28.880         0     no  northwest   3866.85520

In [5]:
data.describe()

               age          bmi     children       charges
count  1320.000000  1338.000000  1338.000000   1314.000000
mean     39.268939    30.663397     1.094918  13303.860902
std      14.023416     6.098187     1.205493  12155.805160
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4724.369462
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16862.795985
max      64.000000    53.130000     5.000000  63770.428010

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1320 non-null float64
sex         1319 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1314 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 73.2+ KB

In [7]:
# fill values for age
age = data.loc[:, 'age'].values.reshape(-1,1)
age[:20]

array([[19.],
       [18.],
       [28.],
       [33.],
       [32.],
       [31.],
       [46.],
       [37.],
       [37.],
       [60.],
       [25.],
       [62.],
       [23.],
       [56.],
       [27.],
       [19.],
       [52.],
       [23.],
       [56.],
       [30.]])

In [8]:
from sklearn.impute import SimpleImputer

In [9]:
imp_mean = SimpleImputer()
imp_median = SimpleImputer(strategy = 'median')
imp_0 = SimpleImputer(strategy = 'constant', fill_value =0)

In [10]:
imp_mean = imp_mean.fit_transform(age)
imp_median = imp_median.fit_transform(age)
imp_0 = imp_0.fit_transform(age)

In [11]:
data.loc[:,'age'] = imp_median
#使用中位数填补age
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1338 non-null float64
sex         1319 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1314 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 73.2+ KB

In [15]:
# fill missing values for charges
from sklearn.impute import SimpleImputer
charges = data.loc[:, 'charges'].values.reshape(-1,1)
charges[:20]
imp_mean = SimpleImputer()
data.loc[:,'charges'] = imp_mean.fit_transform(charges)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1338 non-null float64
sex         1319 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1338 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 73.2+ KB

In [18]:
# fill missing values for sex
from sklearn.impute import SimpleImputer
sex = data.loc[:, 'sex'].values.reshape(-1,1)
imp_mode = SimpleImputer(strategy = 'most_frequent')
data.loc[:,'sex'] = imp_mode.fit_transform(sex)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1338 non-null float64
sex         1338 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1338 non-null float64
dtypes: float64(3), int64(1), object(3)
memory usage: 73.2+ KB

In [19]:
data.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900         0    yes  southwest  16884.92400
1  18.0    male  33.770         1     no  southeast   1725.55230
2  28.0    male  33.000         3     no  southeast   4449.46200
3  33.0    male  22.705         0     no  northwest  21984.47061
4  32.0    male  28.880         0     no  northwest   3866.85520

In [32]:
data_ = data[['sex', 'smoker','region','age','bmi','children','charges']]
data_.head()

      sex smoker     region   age     bmi  children      charges
0  female    yes  southwest  19.0  27.900         0  16884.92400
1    male     no  southeast  18.0  33.770         1   1725.55230
2    male     no  southeast  28.0  33.000         3   4449.46200
3    male     no  northwest  33.0  22.705         0  21984.47061
4    male     no  northwest  32.0  28.880         0   3866.85520

In [20]:
from sklearn.preprocessing import OneHotEncoder

In [34]:
X = data_.iloc[:,0:3]

In [36]:
enc = OneHotEncoder(categories = 'auto').fit(X)
result = enc.transform(X).toarray()
result

array([[1., 0., 0., ..., 0., 0., 1.],
       [0., 1., 1., ..., 0., 1., 0.],
       [0., 1., 1., ..., 0., 1., 0.],
       ...,
       [1., 0., 1., ..., 0., 1., 0.],
       [1., 0., 1., ..., 0., 0., 1.],
       [1., 0., 0., ..., 1., 0., 0.]])

In [37]:
enc.get_feature_names()

array(['x0_female', 'x0_male', 'x1_no', 'x1_yes', 'x2_northeast',
       'x2_northwest', 'x2_southeast', 'x2_southwest'], dtype=object)

In [38]:
result.shape

(1338, 8)

In [40]:
newdata = pd.concat([data_,pd.DataFrame(result)], axis=1)
newdata.head()

,sex,smoker,region,age,bmi,children,charges,0,1,2,3,4,5,6,7
0,female,yes,southwest,19.0,27.900,0,16884.92400,1.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
1,male,no,southeast,18.0,33.770,1,1725.55230,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
2,male,no,southeast,28.0,33.000,3,4449.46200,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
3,male,no,northwest,33.0,22.705,0,21984.47061,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0
4,male,no,northwest,32.0,28.880,0,3866.85520,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0

In [41]:
newdata.drop(['sex','smoker','region'], axis=1, inplace=True)

In [42]:
newdata.head()

    age     bmi  children      charges    0    1    2    3    4    5    6    7
0  19.0  27.900         0  16884.92400  1.0  0.0  0.0  1.0  0.0  0.0  0.0  1.0
1  18.0  33.770         1   1725.55230  0.0  1.0  1.0  0.0  0.0  0.0  1.0  0.0
2  28.0  33.000         3   4449.46200  0.0  1.0  1.0  0.0  0.0  0.0  1.0  0.0
3  33.0  22.705         0  21984.47061  0.0  1.0  1.0  0.0  0.0  1.0  0.0  0.0
4  32.0  28.880         0   3866.85520  0.0  1.0  1.0  0.0  0.0  1.0  0.0  0.0

In [46]:
newdata.columns=['age','bmi','children','charges','x0_female', 'x0_male', 'x1_no', 'x1_yes', 'x2_northeast','x2_northwest', 'x2_southeast', 'x2_southwest']

In [47]:
newdata.head()

,age,bmi,children,charges,x0_female,x0_male,x1_no,x1_yes,x2_northeast,x2_northwest,x2_southeast,x2_southwest
0,19.0,27.900,0,16884.92400,1.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
1,18.0,33.770,1,1725.55230,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
2,28.0,33.000,3,4449.46200,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
3,33.0,22.705,0,21984.47061,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0
4,32.0,28.880,0,3866.85520,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0

In [48]:
new = newdata[['age','bmi','children','x0_female', 'x0_male', 'x1_no', 'x1_yes', 'x2_northeast','x2_northwest', 'x2_southeast', 'x2_southwest','charges']]

In [49]:
new.head()

,age,bmi,children,x0_female,x0_male,x1_no,x1_yes,x2_northeast,x2_northwest,x2_southeast,x2_southwest,charges
0,19.0,27.900,0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,16884.92400
1,18.0,33.770,1,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,1725.55230
2,28.0,33.000,3,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,4449.46200
3,33.0,22.705,0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0,21984.47061
4,32.0,28.880,0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0,3866.85520

In [50]:
X = new.iloc[:, :-1].values
y = new.iloc[:, 11].values

In [51]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [52]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [53]:
score = regressor.score(X_test, y_test)

In [54]:
score

0.7941758158684863

In [67]:
X = new.iloc[:, :7].values
y = new.iloc[:, -1].values
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(X_train, y_train)
score = regressor.score(X_test, y_test)
score

0.7921385948489974

In [68]:
def func3(x):
    if x>0:
        print(x)
        func3(x-1)
func3(5)

5
4
3
2
1

In [69]:
def func4(x):
    if x>0:
        
        func4(x-1)
        print(x)
func4(5)

1
2
3
4
5